Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/connectivity-utilities/JSON_parser/cy_json_parser.c
                            if ( validate_array_value( start, end, len ) != CY_RSLT_SUCCESS )
                            {
                                valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                                object_counter = 0;
                                array_counter = 0;
                                return valid_json_string;
                            }

                            /* Point to last number. Keep moving the value end token back till you encounter a digit */
                            while ( ( *value_end < '0' ) || ( *value_end > '9' ) )
                            {
                                value_end--;
                            }

                            /* Initialise the value_start pointer to point to last digit */
                            value_start = value_end;

                            /* Increment value_start until you reach first number */
                            while ( ( ( *value_start >= '0' ) && ( *value_start <= '9' ) ) || ( *value_start == '.' ) || ( *value_start == '-' ) )
                            {
                                value_start--;
                            }

                            /*Point to first number */
                            value_start++;
                        }

                        /* prepare JSON object */
                        json_object.object_string = NULL;
                        json_object.object_string_length = 0;
                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            str_convertor( &json_object );
                            internal_json_callback( &json_object, internal_json_argument );
                        }

                        string_start = NULL;
                        string_end = NULL;
                        value_start = NULL;
                        value_end = NULL;
                        type = JSON_ARRAY_TYPE;
                    }

                    type = UNKNOWN_JSON_TYPE;
                    previous_token = current_input_token;

                    break;

                case START_OF_VALUE:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    if ( ( *( previous_token  ) == OBJECT_START_TOKEN ) || ( *( previous_token  ) == ARRAY_START_TOKEN ) )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        array_counter = 0;
                        return valid_json_string;
                    }
                    if ( string_end )
                    {
                        /* prepare JSON object */
                        json_object.object_string = string_start + 1;
                        json_object.object_string_length = string_end - string_start - 1;
                        type = UNKNOWN_JSON_TYPE;
                        previous_token = current_input_token;
                    }
                    if ( value_start == NULL )
                    {
                        value_start = current_input_token;
                    }

                    break;

                case COMMA_SEPARATOR:

                    if ( escape_token )
                    {
                        escape_token = false;
                        break;
                    }

                    /* Ignore comma separators in values */
                    if ( ( string_start ) && ( string_end == NULL ) )
                    {
                        break;
                    }
                    /* If this comma is within an array, it must be delimiting values, so extract the comma delimited value */
                    else if ( type == JSON_ARRAY_TYPE )
                    {
                        /* If the token prior to the comma was a string token, then the delimited value must be a string */
                        if ( *previous_token == STRING_TOKEN )
                        {
                            type = JSON_STRING_TYPE;

                            /* Move token to point prior to string token and to last character of string value*/
                            value_end = previous_token - 1;
                            value_start = string_start + 1;
                        }
                        else if ( *previous_token == TRUE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "true" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == FALSE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "false" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == NULL_TOKEN )
                        {
                            type = JSON_NULL_TYPE;
                            value_end = previous_token + sizeof( "null" ) - 2;
                            value_start = previous_token;
                        }
                        else
                        {
                            /* Delimited values must be a NUMBER if they are not a string */
                            type = JSON_NUMBER_TYPE;

                            /* Set value_end to point to current location */
                            value_end = current_input_token;

                            /* Point to last number. Keep moving the value end token back till you encounter a digit */
                            while ( ( *value_end < '0' ) || ( *value_end > '9' ) )
                            {
                                value_end--;
                            }

                            /* Initialise the value_start pointer to point to last digit */
                            value_start = value_end;

                            /* Increment value_start until you reach first number */
                            while ( ( ( ( *value_start >= '0' ) && ( *value_start <= '9' ) ) || ( *value_start == '.' ) || ( *value_start == '-' ) ) && ( *previous_token != *value_start ) )
                            {
                                value_start--;
                            }

