Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/connectivity-utilities/JSON_parser/cy_json_parser.c
                            /*Point to first number */
                            value_start++;
                        }

                        /* prepare JSON object */
                        json_object.object_string = NULL;
                        json_object.object_string_length = 0;
                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            str_convertor( &json_object );
                            internal_json_callback( &json_object, internal_json_argument );
                        }
                        value_start = NULL;
                        value_end = NULL;
                        string_start = NULL;
                        string_end = NULL;
                        type = JSON_ARRAY_TYPE;
                    }
                    else if ( value_start )
                    {
                        value_end = current_input_token;

                        /* Commas are only used to seperate values so this must indicate an end of value, which means last object information is for us */
                        if ( *previous_token == STRING_TOKEN )
                        {
                            type = JSON_STRING_TYPE;

                            value_end = previous_token - 1;
                            value_start = string_start + 1;
                        }
                        else if ( *previous_token == ARRAY_END_TOKEN )
                        {
                            if ( string_start )
                            {
                                type = JSON_STRING_TYPE;
                                value_start = string_start + 1;
                                value_end = string_end - 1;
                            }
                            else
                            {
                                type = JSON_NUMBER_TYPE;

                                /* Keep moving the value end token back till you encounter a digit */
                                while ( ( *value_end < '0' ) || ( *value_end > '9' ) )
                                {
                                    value_end--;
                                }

                                value_start = value_end;

                                while ( ( *value_start >= '0' ) && ( *value_start <= '9' ) )
                                {
                                    value_start--;
                                }

                                value_start++;
                            }
                        }
                        else if ( *previous_token == TRUE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "true" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == FALSE_TOKEN )
                        {
                            type = JSON_BOOLEAN_TYPE;

                            value_end = previous_token + sizeof( "false" ) - 2;
                            value_start = previous_token;
                        }
                        else if ( *previous_token == NULL_TOKEN )
                        {
                            type = JSON_NULL_TYPE;
                            value_end = previous_token + sizeof( "null" ) - 2;
                            value_start = previous_token;
                        }
                        else
                        {
                            type = JSON_NUMBER_TYPE;

                            /* Keep moving the value end token back till you encounter a digit */
                            while ( ( ( *value_end < '0' ) || ( *value_end > '9' ) ) )
                            {
                                value_end--;
                            }

                            value_start = value_end;

                            while ( ( ( *value_start >= '0' ) && ( *value_start <= '9' ) ) || ( *value_start == '.' ) || ( *value_start == '-' ) )
                            {
                                value_start--;
                            }

                            value_start++;
                        }

                        json_object.value_type = type;
                        json_object.value = value_start;
                        json_object.value_length = value_end - value_start + 1;

                        if ( internal_json_callback != NULL )
                        {
                            str_convertor( &json_object );
                            internal_json_callback( &json_object, internal_json_argument );
                        }

                        string_start = NULL;
                        string_end = NULL;
                        value_start = NULL;
                        value_end = NULL;
                        type = UNKNOWN_JSON_TYPE;
                    }

                    previous_token = current_input_token;

                    break;

                case ESCAPE_TOKEN:
                    /* Clear escape token flag, if the previous token is an escape token. Else set it */
                    escape_token = ( escape_token == true ) ? false : true;

                    break;

                default:
                    /* Reset escape token flag */
                    escape_token = false;
                    if ( ( object_counter == 0 ) && ( array_counter == 0 ) && ( *current_input_token  != ' ' ) &&
                         ( JSON_IS_NOT_ESC_CHAR ( *current_input_token ) ) )
                    {
                        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                        object_counter = 0;
                        array_counter = 0;
                        return valid_json_string;
                    }
                    break;
            } // switch

