Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/connectivity-utilities/JSON_parser/cy_json_parser.c
            /* Counting spaces*/
            if ( *( current_input_token ) == ' ' )
            {
                space++;
            }
            else
            {
                space = 0;
            }
            current_input_token++;
            if ( ( *( current_input_token ) == '\0' ) && ( ( ( *( previous_token ) == COMMA_SEPARATOR ) || ( *( previous_token ) == STRING_TOKEN ) || ( *( previous_token ) == START_OF_VALUE ) || ( *( previous_token ) == ARRAY_START_TOKEN ) ) ) )
            {
                valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
                object_counter = 0;
                array_counter = 0;
                return valid_json_string;
            }
        } // while
    }     // if
    else
    {
        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
        return valid_json_string;
    }

    /* This means that a closing brace has not been found for an object. This data is split across packets */
    if ( object_counter || array_counter )
    {
        memset( packet_backup, 0x0, sizeof( packet_backup ) );

        // Copy everything from the most recent unfinished object onwards

        number_of_bytes_backed_up = end_of_input - most_recent_object_marker;

        if( most_recent_object_marker != NULL )
        {
            memcpy( packet_backup, most_recent_object_marker, number_of_bytes_backed_up );
        }

        incomplete_response = true;
        valid_json_string = CY_RSLT_JSON_GENERIC_ERROR;
        object_counter      = 0;

        return valid_json_string;
    }


    memset( &parent_json_object, 0x0, sizeof( parent_json_object ) );

    incomplete_response = false;

    object_counter      = 0;

    string_start        = NULL;
    string_end          = NULL;

    value_start         = NULL;
    value_end           = NULL;

    type                = UNKNOWN_JSON_TYPE;

    escape_token        = false;

    previous_token      = NULL;

    return valid_json_string;
}
